hello-yan3/STM32-learning/19-MPU6050/2. MPU6050_DMP 野火测试例程/User/main.c
// 这个搬过去然后注释吧！！！
    dmp_register_android_orient_cb(android_orient_cb);
    /*
     * Known Bug -
     * DMP when enabled will sample sensor data at 200Hz and output to FIFO at the rate
     * specified in the dmp_set_fifo_rate API. The DMP will then sent an interrupt once
     * a sample has been put into the FIFO. Therefore if the dmp_set_fifo_rate is at 25Hz
     * there will be a 25Hz interrupt from the MPU device.
     *
     * There is a known issue in which if you do not enable DMP_FEATURE_TAP
     * then the interrupts will be at 200Hz even if fifo rate
     * is set at a different rate. To avoid this issue include the DMP_FEATURE_TAP
     *
     * DMP sensor fusion works only with gyro at +-2000dps and accel +-2G
     *///设置dmp功能
    hal.dmp_features = DMP_FEATURE_6X_LP_QUAT | DMP_FEATURE_TAP |
        DMP_FEATURE_ANDROID_ORIENT | DMP_FEATURE_SEND_RAW_ACCEL | DMP_FEATURE_SEND_CAL_GYRO |
        DMP_FEATURE_GYRO_CAL;
    dmp_enable_feature(hal.dmp_features);
		//设置输出速率
    dmp_set_fifo_rate(DEFAULT_MPU_HZ);
//使能dmp
		mpu_set_dmp_state(1);
    hal.dmp_on = 1;
 

  while(1){
	  
    unsigned long sensor_timestamp;
    int new_data = 0;
    if (USART_GetFlagStatus (DEBUG_USARTx, USART_FLAG_RXNE)) {
        /* A byte has been received via USART. See handle_input for a list of
         * valid commands.
         */
		
        USART_ClearFlag(DEBUG_USARTx, USART_FLAG_RXNE);
//！！！这个东西里面调用了自检！！！
        handle_input();
			//！！！！！试试不自检会怎么样！！！！
					//！！！！！试试不自检会怎么样！！！！		
			// ……………………
			// 其实在这里面设置的，好多都是main函数最前面的！
    }
    get_tick_count(&timestamp);
		/*
		后面程序up自己写的！
		但是官方在哪里处理？
		
		
		
		*/
 #ifdef COMPASS_ENABLED
        /* We're not using a data ready interrupt for the compass, so we'll
         * make our compass reads timer-based instead.
         */
        if ((timestamp > hal.next_compass_ms) && !hal.lp_accel_mode &&
            hal.new_gyro && (hal.sensors & COMPASS_ON)) {
            hal.next_compass_ms = timestamp + COMPASS_READ_MS;
            new_compass = 1;
        }
#endif
        /* Temperature data doesn't need to be read with every gyro sample.
         * Let's make them timer-based like the compass reads.
         */
        if (timestamp > hal.next_temp_ms) {
            hal.next_temp_ms = timestamp + TEMP_READ_MS;
            new_temp = 1;
        }

    if (hal.motion_int_mode) {
        /* Enable motion interrupt. */
        mpu_lp_motion_interrupt(500, 1, 5);
        /* Notify the MPL that contiguity was broken. */
        inv_accel_was_turned_off();
        inv_gyro_was_turned_off();
        inv_compass_was_turned_off();
        inv_quaternion_sensor_was_turned_off();
        /* Wait for the MPU interrupt. */
        while (!hal.new_gyro) {}
					// 如果是0，循环，直到变为1  继续向下！天才！
        /* Restore the previous sensor configuration. */
        mpu_lp_motion_interrupt(0, 0, 0);
        hal.motion_int_mode = 0;
    }
// hal.sensors是串口收到数据处理！默认0 → 1  总之就是1对了！
    if (!hal.sensors || !hal.new_gyro) {
        continue;
    }    
        if (hal.new_gyro && hal.lp_accel_mode) {
            short accel_short[3];
            long accel[3];
            mpu_get_accel_reg(accel_short, &sensor_timestamp);
            accel[0] = (long)accel_short[0];
            accel[1] = (long)accel_short[1];
            accel[2] = (long)accel_short[2];
            inv_build_accel(accel, 0, sensor_timestamp);
            new_data = 1;
            hal.new_gyro = 0;
        } else if (hal.new_gyro && hal.dmp_on) {
            short gyro[3], accel_short[3], sensors;
            unsigned char more;
            long accel[3], quat[4], temperature;
            /* This function gets new data from the FIFO when the DMP is in
             * use. The FIFO can contain any combination of gyro, accel,
             * quaternion, and gesture data. The sensors parameter tells the
             * caller which data fields were actually populated with new data.
             * For example, if sensors == (INV_XYZ_GYRO | INV_WXYZ_QUAT), then
             * the FIFO isn't being filled with accel data.
             * The driver parses the gesture data to determine if a gesture
             * event has occurred; on an event, the application will be notified
             * via a callback (assuming that a callback function was properly
             * registered). The more parameter is non-zero if there are
             * leftover packets in the FIFO.
             */
					
					/*
					当DMP正在使用时，此函数从FIFO获取新数据。
					FIFO可以包含陀螺仪、加速度、四元数和手势数据的任何组合。
					传感器参数告诉调用者哪些数据字段实际上填充了新数据。
					例如，如果传感器==（INV_XYZ_GYRO|INV_WXYZ_QUAT），
					则FIFO未填充加速度数据。驾驶员解析手势数据以确定手势事件是否已经发生；
					在事件中，应用程序将通过回调得到通知（假设回调函数已正确注册）。
					如果FIFO中有剩余数据包，则more参数为非零。
*/
						
					// 角速度，加速度，四元数。传感器时间等等
            dmp_read_fifo(gyro, accel_short, quat, &sensor_timestamp, &sensors, &more);
						
//					 if (hal.new_gyro && hal.lp_accel_mode) {
//            short accel_short[3];
//            long accel[3];
//            mpu_get_accel_reg(accel_short, &sensor_timestamp);
//            accel[0] = (long)accel_short[0];
//            accel[1] = (long)accel_short[1];
//            accel[2] = (long)accel_short[2];
//            inv_build_accel(accel, 0, sensor_timestamp);
//            new_data = 1;
//            hal.new_gyro = 0;
//        } 

//else if (hal.new_gyro && hal.dmp_on) {
//            short gyro[3], accel_short[3], sensors;！！！这里也有！
//            unsigned char more;
//            long accel[3], quat[4], temperature;！！！！在这里！
//						
						
						// sensor！！是标志位！标志哪个参数为1的！！！
						
						
						
            if (!more)
                hal.new_gyro = 0;
						// 像这样！通过if判断 是否标志位为1！
            if (sensors & INV_XYZ_GYRO) {
                /* Push the new data to the MPL. */
                inv_build_gyro(gyro, sensor_timestamp);
                new_data = 1;
                if (new_temp) {
                    new_temp = 0;
                    /* Temperature only used for gyro temp comp. */
									
									// 这里是获得温度！
									
									// 最后只是解析四元数吗？……
									
									// 还有获取温度可以最后获取
									
                    mpu_get_temperature(&temperature, &sensor_timestamp);
                    inv_build_temp(temperature, sensor_timestamp);
                }
            }
            if (sensors & INV_XYZ_ACCEL) {
                accel[0] = (long)accel_short[0];
                accel[1] = (long)accel_short[1];
                accel[2] = (long)accel_short[2];
                inv_build_accel(accel, 0, sensor_timestamp);
                new_data = 1;
            }
            if (sensors & INV_WXYZ_QUAT) {
							
